Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Any internal implementation details of your framework can still use the default access level of internal, or can be marked as private or file private if you want to hide them from other parts of the framework’s internal code.
ja: あなたのフレームワークのあらゆる内部的実装詳細は、依然として省略時のアクセス水準である内部を使用します、もしくはあなたがそれらをそのフレームワークの内部コードの他の部分から隠したいならば非公開またはファイル限定として印されることができます。

source: Any protocol that inherits from a protocol that’s marked with the AnyObject requirement can likewise be adopted only by class types.
ja: AnyObject要件で印されるプロトコルから継承するどんなプロトコルも、同じようにクラス型でのみ採用されることができます。

source: Any punctuation except (, ), [, ], {, or }
ja: 任意の句読点、しかし(, ), [, ], {, または }を除く

source: Any side effects of a key path expression are evaluated only at the point where the expression is evaluated.
ja: キーパス式のあらゆる副作用は、式が評価されるところの時点でのみ評価されます。

source: Any type aliases you define are treated as distinct types for the purposes of access control.
ja: あなたが定義するどんな型エイリアスでも、アクセス制御の目的のためにはっきりした型とみなされます。

source: Any type argument substituted for a type parameter must meet all the constraints and requirements placed on the type parameter.
ja: 型パラメータと置き換えられるどんな型引数でも、型パラメータに設置された制約と要件の全てに応じなければなりません。

source: Any type can be explicitly declared to be (or implicitly converted to) an optional type.
ja: あらゆる型は、オプショナル型であるとして明示的に宣言される（または暗黙的に変換される）ことができます。

source: Any type members added in an extension have the same default access level as type members declared in the original type being extended.
ja: 拡張において加えられるどんな型メンバーでも、拡張されているところの本来の型で宣言される型メンバーと同じ省略時のアクセス水準を持ちます。

source: Any type that conforms to the Container protocol must be able to specify the type of values it stores.
ja: Containerプロトコルに準拠するあらゆる型は、それが格納する値の型を指定することができなければなりません。

source: Any type that is Equatable can be used safely with the findIndex(of:in:) function, because it’s guaranteed to support the equal to operator.
ja: Equatableであるどんな型でもfindIndex(of:in:)関数で問題なく使われることができます、なぜなら、それが同等演算子をサポートすると保証されるからです。

source: Any type that satisfies the requirements of a protocol is said to conform to that protocol.
ja: あるプロトコルの要件を満たす何らかの型は、そのプロトコルに準拠すると言われます。

source: Any variables or constants that were assigned values using an optional binding as part of the condition are available for the rest of the code block that the guard statement appears in.
ja: オプショナル束縛を使ってこの条件の一部として値を代入された、あらゆる変数や定数は、guard文が現れるコードブロックの残りの部分で利用可能です。

source: Any whitespace between the backslash and the line break is also omitted.
ja: バックスラッシュとラインブレークの間のあらゆる空白もまた省かれます。

source: Anything that adopts PrettyTextRepresentable must satisfy all of the requirements enforced by TextRepresentable, plus the additional requirements enforced by PrettyTextRepresentable.
ja: PrettyTextRepresentableを採用するどんなものでも、TextRepresentableによって強制される要件の全て、それに加えてPrettyTextRepresentableによって強制される追加の要件を満たさなければなりません。

source: Anything that is PrettyTextRepresentable must also be TextRepresentable, and so the implementation of prettyTextualDescription starts by accessing the textualDescription property from the TextRepresentable protocol to begin an output string.
ja: PrettyTextRepresentableであるものは何でも、またTextRepresentableでなければなりません、なのでprettyTextualDescriptionの実装は出力文字列を開始するためにTextRepresentableプロトコルからのtextualDescriptionプロパティにアクセスすることによって始まります。

source: Apply that new attribute to a property of a class, structure, or enumeration to wrap access to the property through an instance of the wrapper type.
ja: その新しい属性をクラス、構造体、または列挙のあるプロパティに適用することで、ラッパー型のインスタンスによって、そのプロパティに対するアクセスをラップしてください。

source: Apply this attribute to a class declaration to require all stored properties within the class to provide default values as part of their definitions.
ja: この属性をあるクラス宣言に適用することで、そのクラス内の全ての格納プロパティに、省略時の値をそれら宣言の一部として提供することを要求してください。

source: Apply this attribute to a class declaration, to implicitly apply the objc attribute to all Objective-C compatible members of the class, its extensions, its subclasses, and all of the extensions of its subclasses.
ja: この属性をあるクラス宣言に適用してください、暗黙的にobjc属性をそのクラスの全てのObjective-C互換メンバー、それの拡張、それのサブクラス、そしてそれのサブクラスの全ての拡張に適用するには。

source: Apply this attribute to a class to indicate that it’s the application delegate.
ja: この属性をあるクラスに適用することで、それがアプリケーション委任先であることを指し示してください。

source: Apply this attribute to a class, structure, enumeration, or protocol to enable members to be looked up by name at runtime.
ja: この属性をクラス、構造体、列挙、またはプロトコルに適用して、メンバが実行時に名前で検索されることを可能にしてください。

source: Apply this attribute to a class, structure, enumeration, or protocol to treat instances of the type as callable functions.
ja: この属性をクラス、構造体、列挙、またはプロトコルに適用することで、その型のインスタンスをcallable関数として扱ってください。

source: Apply this attribute to a class, structure, or enumeration declaration to use that type as a property wrapper.
ja: この属性をクラス、構造体、または列挙の宣言に適用して、その型をプロパティラッパーとして使ってください。

source: Apply this attribute to a function or method declaration to suppress the compiler warning when the function or method that returns a value is called without using its result.
ja: この属性を関数またはメソッド宣言に適用して、値を返す関数やメソッドがそれの結果を使うことなく呼び出された時にコンパイラが警告を発するのを抑制してください。

source: Apply this attribute to a function, method, computed property, subscript, convenience initializer, or deinitializer declaration to expose that declaration’s implementation as part of the module’s public interface.
ja: この属性を関数、メソッド、計算プロパティ、添え字、便宜イニシャライザ、またはデイニシャライザ宣言に適用することで、宣言の実装をモジュールの公開インターフェイスの一部として露出してください。

source: Apply this attribute to a function, method, computed property, subscript, initializer, or deinitializer declaration to allow that symbol to be used in inlinable code that’s defined in the same module as the declaration.
ja: この属性を関数、メソッド、計算プロパティ、添え字、便宜イニシャライザ、またはデイニシャライザ宣言に適用することで、そのシンボルが、同じモジュールの中で宣言として定義されるインライン可能コードにおいて使用できるようにしてください。

source: Apply this attribute to a method, property, subscript, or initializer declaration to suppress an implicit objc attribute.
ja: この属性をメソッド、プロパティ、添え字、およびイニシャライザ宣言に適用することで、暗黙的にobjc属性となるのを抑制してください。

source: Apply this attribute to a parameter’s type in a method or function declaration to indicate that the parameter’s value can be stored for later execution.
ja: この属性をメソッドや関数宣言の中のパラメータの型に適用して、そのパラメータの値がその後の実行のために保管されることができるのを指し示してください。

source: Apply this attribute to a stored variable property of a class.
ja: この属性をクラスの格納変数プロパティに適用してください。

source: Apply this attribute to a structure or enumeration declaration to restrict the kinds of changes you can make to the type.
ja: この属性を構造体または列挙宣言に適用して、あなたがその型にすることが出来る変更の種類を制約してください。

source: Apply this attribute to a switch case to indicate that it isn’t expected to be matched by any case of the enumeration that’s known at the time the code is compiled.
ja: この属性をスイッチケース節に適用して、コードがコンパイルされる時点で既知である列挙のどんなケース節によってもそれが合致されることは期待されないことを指し示してください。

source: Apply this attribute to a top-level function, instance method, or class or static method to trigger warnings when that function or method is used without a preceding qualifier, such as a module name, type name, or instance variable or constant.
ja: この属性をトップレベルの関数、インスタンスメソッド、もしくはクラスまたは静的メソッドに適用することで、その関数またはメソッドが、例えばモジュール名、型名、またはインスタンス変数や定数など、先行する修飾語無しで使われる場合に警告を引き起こしてください。

source: Apply this attribute to an import declaration to import that module with changes to its access control that simplify testing the module’s code.
ja: この属性をあるimport宣言に適用することで、そのモジュールのインポートをそれのアクセス制御への、モジュールの持つコードを試験するのを簡単にする変更とともに行ってください。

source: Apply this attribute to an instance method or stored variable property of a class that inherits from NSManagedObject to indicate that Core Data dynamically provides its implementation at runtime, based on the associated entity description.
ja: この属性をNSManagedObjectから継承するクラスのインスタンスメソッドまたは格納変数プロパティに適用することで、関連する実体記述に基づいて、Coreデータが動的にそれの実装に実行時に提供されることを指し示してください。

source: Apply this attribute to any declaration that can be represented in Objective-C—for example, nonnested classes, protocols, nongeneric enumerations (constrained to integer raw-value types), properties and methods (including getters and setters) of classes, protocols and optional members of a protocol, initializers, and subscripts.
ja: この属性をObjective-Cにおいて表わされることができる何らかの宣言に適用してください ― 例えば、入れ子にされないクラス、プロトコル、総称体でない列挙（整数の生の値型に制限される）、クラスのプロパティとメソッド（ゲッターやセッターを含む）、プロトコルおよびあるプロトコルのオプショナルメンバ、イニシャライザ、そして添え字など。

source: Apply this attribute to delay the evaluation of an expression by automatically wrapping that expression in a closure with no arguments.
ja: この属性を適用することで、ある式の評価の延期を、自動的にその式を引数なしクロージャの中にラップすることによって行ってください。

source: Apply this attribute to expose a custom GameplayKit component property to the SpriteKit editor UI.
ja: この属性を適用することであつらえのGameplayKitコンポーネントプロパティをSpriteKitエディタUIに露出してください。

source: Apply this attribute to indicate a declaration’s life cycle relative to certain Swift language versions or certain platforms and operating system versions.
ja: この属性を適用することで、ある宣言の寿命を、特定のスウィフト言語バージョンまたは特定のプラットホームおよびオペレーティングシステムバージョンに相関的に指し示してください。

source: Apply this attribute to the type of a function to indicate its calling conventions.
ja: この属性を関数の型に適用して、それの呼出規約を示してください。

source: Apply this modifier to a class or to a property, method, or subscript member of a class.
ja: この修飾子をクラスに、またはプロパティ、メソッド、またはクラスの添え字メンバーに適用してください。

source: Apply this modifier to a declaration to indicate the declaration can be accessed and subclassed by code in the same module as the declaration.
ja: この修飾子を宣言に適用して、その宣言がアクセスされることおよびサブクラスを作られることが、宣言と同じモジュールの中のコードによって可能なのを指し示してください。

source: Apply this modifier to a declaration to indicate the declaration can be accessed only by code in the same module as the declaration.
ja: この修飾子を宣言に適用して、その宣言が、宣言と同じモジュールの中のコードによってのみアクセスされることができるのを指し示してください。

source: Apply this modifier to a declaration to indicate the declaration can be accessed only by code in the same source file as the declaration.
ja: この修飾子を宣言に適用して、その宣言が、宣言と同じソースファイルの中のコードによってのみアクセスされることができるのを指し示してください。

source: Apply this modifier to a declaration to indicate the declaration can be accessed only by code within the declaration’s immediate enclosing scope.
ja: この修飾子を宣言に適用して、その宣言がアクセスされることは、宣言が直に囲んでいるスコープ内のコードによってのみ可能なのを指し示してください。

source: Apply this modifier to a designated or convenience initializer of a class to indicate that every subclass must implement that initializer.
ja: この修飾子をクラスの必須または便宜イニシャライザに適用して、全てのサブクラスがそのイニシャライザを実装しなければならないことを指し示してください。

source: Apply this modifier to a member of a class to indicate that the member is a member of the class itself, rather than a member of instances of the class.
ja: この修飾子をクラスのメンバーに適用して、そのメンバーがそのクラスそれ自身のメンバーであることを指し示してください、そのクラスのインスタンスのメンバーではなくて。

source: Apply this modifier to a member of a structure, class, enumeration, or protocol to indicate that the member is a member of the type, rather than a member of instances of that type.
ja: この修飾子を構造体、クラス、列挙、またはプロトコルのメンバーに適用して、そのメンバーがその型のメンバーであることを指し示してください、その型のインスタンスのメンバーではなくて。

source: Apply this modifier to a protocol’s property, method, or subscript members to indicate that a conforming type isn’t required to implement those members.
ja: この修飾子をプロトコルのプロパティ、メソッド、または添え字メンバーに適用して、ある準拠型がそれらのメンバーを実装する必要がないことを指し示してください。

source: Apply this modifier to a stored variable or stored variable property to indicate that the variable or property has a weak reference to the object stored as its value.
ja: この修飾子を格納変数または格納変数プロパティに適用して、その変数またはプロパティがそれの値として格納されるオブジェクトに対して弱い参照を持つことを指し示してください。

source: Apply this modifier to a stored variable property of a class or structure to indicate that the property’s initial value is calculated and stored at most once, when the property is first accessed.
ja: この修飾子をクラスまたは構造体の格納変数プロパティに適用して、そのプロパティの初期値が最大でも一度だけ、そのプロパティが最初にアクセスされるときに、計算または格納されることを指し示してください。

source: Apply this modifier to a stored variable, constant, or stored property to indicate that the variable or property has an unowned reference to the object stored as its value.
ja: この修飾子を格納変数、定数、または格納プロパティに適用して、その変数またはプロパティがそれの値として格納されるオブジェクトに対して非所有参照を持つことを指し示してください。

source: Apply this modifier to any member of a class that can be represented by Objective-C.
ja: この修飾子をObjective-Cによって表わされることのできるクラスのあらゆるメンバーに適用してください。

source: Applying the IBAction, IBSegueAction, IBOutlet, IBDesignable, or IBInspectable attribute also implies the objc attribute.
ja: IBAction、IBSegueAction、IBOutlet、IBDesignable、またはIBInspectable属性を適用することはまた、暗黙的にobjc属性を伴います。

source: Applying the objc attribute when it isn’t needed can increase your binary size and adversely affect performance.
ja: それが必要とされない時にobjc属性を適用することは、あなたのバイナリサイズを増加させ性能に逆効果です。

source: Applying this attribute also implies the objc attribute.
ja: この属性を適用することはまた、objc属性も暗に意味します。

source: Applying this attribute to an extension has the same effect as applying it to every member of that extension that isn’t explicitly marked with the nonobjc attribute.
ja: この属性をある拡張に適用することは、その拡張のあらゆるメンバで明示的にnonobjc属性で印されていないものにそれを適用することと同じ効果を持ちます。

source: Applying this attribute to an extension has the same effect as applying it to every member of that extension that isn’t explicitly marked with the objc attribute.
ja: この属性をある拡張に適用することは、明示的にobjc属性で印されていないその拡張のあらゆるメンバにそれを適用することと同じ効果を持ちます。

source: Argument labels must always be used in an initializer if they are defined, and omitting them is a compile-time error:
ja: 引数ラベルは、それらが定義されるならば常にイニシャライザで使われなければなりません、そして、それらを省略することはコンパイル時エラーになります：

source: Argument names in functions and methods are not part of the corresponding function type.
ja: 関数やメソッドの引数名は、対応する関数型の一部ではありません。

source: Arithmetic Operators
ja: 算術演算子

source: Arithmetic operators (+, -, *, /, % and so forth) detect and disallow value overflow, to avoid unexpected results when working with numbers that become larger or smaller than the allowed value range of the type that stores them.
ja: 算術演算子（+、-、*、/、%その他）は、値があふれること（オーバフロー）を検知して承認しません、数を扱うときにそれらを格納する型の許容される値の範囲より大きいか小さくなる予想外の結果を防ぐためです。

source: Array Type
ja: 配列型

source: Array Type Shorthand Syntax
ja: 配列型の短縮形構文

source: Array indices are checked for out-of-bounds errors.
ja: 配列インデックスは、境界外エラーを確認される。

source: Arrays
ja: 配列

source: Arrays are ordered collections of values.
ja: 配列は、順番をつけられた値のコレクションです。

source: Arrays automatically grow as you add elements.
ja: 配列は、あなたが要素を追加するとき自動的に増大します。

source: Arrays in Swift are always zero-indexed.
ja: スウィフトの配列は、常に０からのインデックスをつけられます。

source: Arrays, sets, and dictionaries in Swift are always clear about the types of values and keys that they can store.
ja: スウィフトの配列、集合、そして辞書は、それらが格納できる値とキーの型について常に明確です。

source: Array’s existing append(_:) method and subscript enable Swift to infer the appropriate type to use for Item, just as for the generic Stack type above.
ja: 配列の既存のappend(_:)メソッドと添え字は、スウィフトに、ちょうど上の総称体Stack型と同じように、Itemに使うのに適当な型を推論するのを可能にします。

source: As a general guideline, prefer structures because they’re easier to reason about, and use classes when they’re appropriate or necessary.
ja: 一般的な指針として、構造体を選んでください、なぜならそれらは推論するのがより簡単だからです、そしてそれが適切または必要である場合はクラスを使ってください。

source: As a parameter type or return type in a function, method, or initializer
ja: 関数、メソッド、またはイニシャライザにおいてパラメータ型または戻り型として

source: As a result, ARC never sets an unowned reference’s value to nil, which means that unowned references are defined using non-optional types.
ja: 結果として、ARCは決して非所有参照のもつ値をnilに設定しません、それは非所有参照が非オプショナル型を使って定義されることを意味します。

source: As a result, a failable initializer can return nil to indicate that initialization failed.
ja: 結果として、失敗できるイニシャライザは、そのイニシャライザが失敗したのを指し示すためにnilを返すことができます。

source: As a result, code is not just easier to write, but easier to read and maintain as well.
ja: 結果として、コードは書くのがより簡単なだけでなく、読むことおよび管理するのもまたより簡単です。

source: As a result, if multiple cases contain patterns that evaluate to the same value, and thus can match the value of the control expression, the program executes only the code within the first matching case in source order.
ja: その結果、複数のケース節が同じ値に評価される、そしてそれゆえ制御式の値にマッチすることができるパターンを含むならば、プログラムはソース順において最初のマッチしているケース節内のコードだけを実行します。

source: As a result, in many cases you don’t need to specify an explicit access level in your code.
ja: その結果、多くの場合には、あなたはあなたのコードにおいて明示的にアクセス水準を指定する必要がありません。

source: As a result, it automatically receives a default initializer, as described in Default Initializers.
ja: 結果として、省略時のイニシャライザで記述されるように、それは自動的に省略時のイニシャライザを受け取ります。

source: As a result, only class types can adopt and conform to a protocol that contains optional member requirements.
ja: 結果として、クラス型だけがオプショナルメンバー要件を含むプロトコルを採用および準拠することができます。

source: As a result, the endIndex property isn’t a valid argument to a string’s subscript.
ja: 結果として、endIndexプロパティは、文字列の添え字として有効な引数ではありません。

source: As a result, the statements are compiled and executed only if the compilation condition evaluates to true at compile time.
ja: 結果として、statements（文）がコンパイル及び実行されるのはcompilation conditionがコンパイル時にtrueに評価される場合に限ります。

source: As a result, the number of characters in a string can’t be calculated without iterating through the string to determine its extended grapheme cluster boundaries.
ja: その結果、ある文字列の中の文字の数は、それの拡張書記素クラスタ境界を解決するためにその文字列の最初から終わりまで繰り返していくことなしに計算されることができません。

source: As a result, the value of the customerProvider argument must be allowed to escape the function’s scope.
ja: その結果、customerProvider引数の値は関数のスコープを脱出することを許されなければなりません。

source: As a result, there’s no need to use whitespace to disambiguate between the closing > characters in constructs like Dictionary<String, Array<Int>>.
ja: その結果、閉じ>文字の間の曖昧さをなくすために空白を使う必要は、Dictionary<String, Array<Int>>のような構造物においてはありません。

source: As a result, they are both evaluated before the addition is considered.
ja: 結果として、それらは両方とも、加算が考慮される前に評価されます。

source: As a result, they have a rawValue property and a failable initializer with the signature init?(rawValue: RawValue).
ja: 結果として、それはrawValueプロパティとシグネチャinit?(rawValue: RawValue)を持つ失敗できるイニシャライザを持ちます。

source: As a result, whether a closure expression is escaping or nonescaping depends on the surrounding context of the expression.
ja: 結果として、あるクロージャ式が脱出または非脱出であるかどうかは、その式を取り囲んでいる前後関係に依存します。

source: As a result, you can use a nonthrowing function in the same places as a throwing one.
ja: 結果として、あなたは非スロー関数をスロー関数と同じ場所で使うことができます。

source: As a result, you can:
ja: 結果として、あなたは次のことが出来ます：

source: As a result, you do not write the override modifier when providing a matching implementation of a superclass convenience initializer.
ja: 結果として、あなたはスーパークラスの便宜イニシャライザに一致する実装を提供している時にoverride修飾子を書きません。

source: As a result, you don’t implement the getter or setter directly in the protocol in which it is declared.
ja: 結果として、それが宣言されるプロトコルにおいて、あなたは直接ゲッターまたはセッターを実装しません。

source: As a result, you must include at least one statement following the colon (:) of each case label.
ja: その結果、あなたはそれぞれのケース節ラベルのコロン（:）に続いている文を少なくとも１つは含めなければなりません。

source: As a result, you never need to write an inline closure in its fullest form when the closure is used as a function or method argument.
ja: その結果、あなたは、行内クロージャをその最も完全な形式で書くことは、そのクロージャが関数やメソッドの引数として使われる時にまったく必要ありません。

source: As a shortcut to accessing its rooms array, this version of Residence provides a read-write subscript that provides access to the room at the requested index in the rooms array.
ja: そのrooms配列にアクセスすることへの近道として、Residenceのこの版は読み出し専用の添え字を提供します、それは、rooms配列の中の要求されたインデックスでの部屋へのアクセスを提供します。

source: As an alternative to associated values, enumeration cases can come prepopulated with default values (called raw values), which are all of the same type.
ja: 関連値に代わるものとして、列挙ケース節は全て同じ型の（生の値と呼ばれる）初期値があらかじめ入れられた状態であることが出来ます。

source: As an alternative to querying their value properties, each UnicodeScalar value can also be used to construct a new String value, such as with string interpolation:
ja: それらのvalueプロパティについて尋ねることに代わるものとして、各UnicodeScalar値は、また、新しいString値を造るために使われることもできます、例えば文字列補間を使って：

source: As an alternative to subscripting, use a dictionary’s updateValue(_:forKey:) method to set or update the value for a particular key.
ja: 添え字指定に代わるものとして、辞書のupdateValue(_:forKey:)メソッドを、特定のキーに対する値を設定したり更新したりするために使ってください。

source: As an example, Swift’s Array type has a map(_:) method which takes a closure expression as its single argument.
ja: 例として、スウィフトのArray型はmap(_:)メソッドを持ちます、そしてそれは、そのただ１つの引数としてクロージャ式をとります。

source: As an example, consider the task of reading and processing data from a file on disk.
ja: ひとつの例として、ディスク上のファイルからデータを読み込んで処理する作業を考えてみてください。

source: As an example, many functions that start an asynchronous operation take a closure argument as a completion handler.
ja: 例として、非同期の演算を開始する多くの関数は、クロージャ引数を完了ハンドラとして取ります。

source: As an example, the +++ operator in a+++ b is treated as a postfix unary operator.
ja: 例として、a+++ bにおける+++演算子は、接尾辞単項演算子とみなされます。

source: As an example, the +++ operator in a+++b and a +++ b is treated as a binary operator.
ja: 例として、a+++bとa +++ bにおける+++演算子は、二項演算子とみなされます。

source: As an example, the +++ operator in a +++b is treated as a prefix unary operator.
ja: 例として、a +++bにおける+++演算子は、接頭辞単項演算子とみなされます。

source: As an example, the +++ operator in a+++.b is treated as a postfix unary operator (a+++ .b rather than a +++ .b).
ja: 例として、+++演算子はa+++.bにおいて、接尾辞単項演算子（a+++ .b、a +++ .bではなく）とみなされます。

source: As an example, the grammar of a getter-setter block is defined as follows:
ja: 例として、ゲッターセッター・ブロックの文法は、次のように定義されます：

source: As an optimization, Swift may instead capture and store a copy of a value if that value is not mutated by a closure, and if the value is not mutated after the closure is created.
ja: ひとつの最適化として、その値がクロージャによって変化させられないならば、そしてその値がクロージャが作成された後に変化されられないならば、スウィフトはそれよりむしろ値のコピーをキャプチャして保管するかもしれません。

source: As an optimization, when the argument is a value stored at a physical address in memory, the same memory location is used both inside and outside the function body.
ja: ひとつの最適化として、引数がメモリにおいて物理的番地に格納される値である時、同じメモリ位置は関数本体の内側と外側の両方で使われます。

source: As can be seen above, the getter correctly returns a center point of (5, 5).
ja: 上で見られるように、ゲッターは正しく中心点(5, 5)を返します。

source: As demonstrated in Optional Chaining as an Alternative to Forced Unwrapping, you can use optional chaining to access a property on an optional value, and to check if that property access is successful.
ja: 強制アンラップに代わるものとしてのオプショナル連鎖で例示されるように、あなたはオプショナル連鎖を使って、あるオプショナル上でプロパティにアクセスして、そのプロパティへのアクセスが成功したか調べることができます。

source: As described above, optionals indicate that a constant or variable is allowed to have “no value”.
ja: 先に述べたように、オプショナルは、ある定数や変数が「値がない」状態でも許されることを示します。

source: As described above, the ultimate return type of this method call after optional chaining is also String?:
ja: 先に述べたように、オプショナル連鎖の後ろのこのメソッド呼び出しの最終的な戻り型は、また、String?です：

source: As described in Control Flow, a switch statement must be exhaustive when considering an enumeration’s cases.
ja: 制御の流れで記述されるように、switch文は列挙のケース節を考慮するとき、徹底的でなければなりません。

source: As described in Default Initializers, Swift automatically provides a default initializer without any arguments for any structure or base class that provides default values for all of its properties and doesn’t provide at least one initializer itself.
ja: 省略時のイニシャライザで記述されるように、スウィフトは、全く引数を持たない省略時のイニシャライザを、あらゆる構造体または基盤クラスで、それのプロパティの全てに省略時の値を提供して、とにかく１つのイニシャライザもそれ自身では提供しないもののために、自動的に提供します。

source: As described in Failable Initializers, a special form of the return statement (return nil) can be used in a failable initializer to indicate initialization failure.
ja: 失敗できるイニシャライザで記述されるように、return文の特別な形式（return nil）は、失敗できるイニシャライザの中で使用されて初期化失敗を指し示すことができます。

source: As described in Dictionaries, the type of a dictionary’s keys must be hashable.
ja: 辞書で記述されるように、辞書のキーの型は、ハッシュ化できなければなりません。

source: As discussed in Initializer Declaration, classes can have designated and convenience initializers.
ja: イニシャライザ宣言で議論されるように、クラスは、指定および便宜イニシャライザを持つことができます。

source: As expected, the counter’s count property increases by three each time increment() is called.
ja: 予想されるように、counterのcountプロパティは、increment()が呼ばれるたびに３つずつ増加します。
